---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpecTypeId.Reference
source: html/0dfe3aab-dbb6-2e78-e330-1237a9e9f311.htm
---
# SpecTypeId.Reference Members

This class contains constants identifying specs.